In [1]:
import pandas as pd
import numpy as np

In [2]:
nums = [10, 20, 30, 40, 50]
ser1 = pd.Series(nums)
ser1

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [3]:
type(ser1)

pandas.core.series.Series

In [7]:
row_labels = 'A B C D E'.split()

In [8]:
ser1 = pd.Series(nums, index=row_labels)
ser1

A    10
B    20
C    30
D    40
E    50
dtype: int64

In [10]:
ser1 = pd.Series(nums, index='A B C C C'.split())
ser1

A    10
B    20
C    30
C    40
C    50
dtype: int64

In [11]:
ser1['A']   # indexing works like in a normal dict.

10

In [13]:
ser1['C']

C    30
C    40
C    50
dtype: int64

In [16]:
names = ['Rashmi', 'Sameer', np.pi, np.inf, np.nan]
dept = ['HR', 'HR', 'Tech', 'Tech', 'Sales']
emp = pd.Series(names, index=dept)
emp

HR        Rashmi
HR        Sameer
Tech     3.14159
Tech         inf
Sales        NaN
dtype: object

In [17]:
emp['HR']

HR    Rashmi
HR    Sameer
dtype: object

In [19]:
emp['Tech']

Tech    3.14159
Tech        inf
dtype: object

In [21]:
emp['Sales'] = 9501 # you can also set the values using the indexing!

In [22]:
emp

HR        Rashmi
HR        Sameer
Tech     3.14159
Tech         inf
Sales       9501
dtype: object

In [24]:
emp == 'Rashmi'

HR        True
HR       False
Tech     False
Tech     False
Sales    False
dtype: bool

In [25]:
emp[emp == 'Rashmi']

HR    Rashmi
dtype: object

In [28]:
emp[emp == 'Rashmi'].index[0]

'HR'

In [32]:
emp['Tech'] = [5000, 6000]
emp

HR       Rashmi
HR       Sameer
Tech       5000
Tech       6000
Sales      9501
dtype: object

In [33]:
ser1

A    10
B    20
C    30
C    40
C    50
dtype: int64

In [34]:
ser1.describe()   # quick statistical summary of your Col

count     5.000000
mean     30.000000
std      15.811388
min      10.000000
25%      20.000000
50%      30.000000
75%      40.000000
max      50.000000
dtype: float64

In [38]:
ser1.describe().round(2)

count     5.00
mean     30.00
std      15.81
min      10.00
25%      20.00
50%      30.00
75%      40.00
max      50.00
dtype: float64

In [39]:
ser1[0]

10

In [40]:
ser1[-1]   # linear indexing also works just like numpy arrays, lists

50

# DataFrames

In [50]:
np.random.seed(100)
data = 100*np.random.rand(4,5)
data = data.astype('int32')
data

array([[54, 27, 42, 84,  0],
       [12, 67, 82, 13, 57],
       [89, 20, 18, 10, 21],
       [97, 81, 17, 81, 27]])

In [57]:
row_labels = ['India', 'US', 'UK', 'Japan']
col_labels = 'A B C D E'.split()
df = pd.DataFrame(data, columns=col_labels, index=row_labels)
df

        A   B   C   D   E
India  54  27  42  84   0
US     12  67  82  13  57
UK     89  20  18  10  21
Japan  97  81  17  81  27

In [58]:
df.shape

(4, 5)

In [48]:
df.size  # number of elements

20

In [49]:
df.values   # will retrive the entire values as a numpy array!

array([[54, 27, 42, 84,  0],
       [12, 67, 82, 13, 57],
       [89, 20, 18, 10, 21],
       [97, 81, 17, 81, 27]])

In [51]:
df

        A   B   C   D   E
India  54  27  42  84   0
US     12  67  82  13  57
UK     89  20  18  10  21
Japan  97  81  17  81  27

In [53]:
df['B']   # fetch the values in the col 'B'

India    27
US       67
UK       20
Japan    81
Name: B, dtype: int32

In [55]:
type(df['B'])

pandas.core.series.Series

In [60]:
df[['D', 'B']]  # provide a list of col labels if you want to fetch multiple columns

        D   B
India  84  27
US     13  67
UK     10  20
Japan  81  81

In [61]:
df['India']  # this syntax (providing the row labels) only works for Series datatype

KeyError: 'India'

In [62]:
df.loc['India']  # fetching a single prw by providinf its label (use the .loc)

A    54
B    27
C    42
D    84
E     0
Name: India, dtype: int32

In [64]:
type(df.loc['India'])

pandas.core.series.Series

In [65]:
df.loc[['US', 'India']] # list of row labels to be used for fetching multiple rows !!

        A   B   C   D   E
US     12  67  82  13  57
India  54  27  42  84   0

In [67]:
df

        A   B   C   D   E
India  54  27  42  84   0
US     12  67  82  13  57
UK     89  20  18  10  21
Japan  97  81  17  81  27

In [66]:
df.iloc[0, 2]  # this row,loc indexing

42

In [68]:
df.iloc[0, 2] = 4200
df

        A   B     C   D   E
India  54  27  4200  84   0
US     12  67    82  13  57
UK     89  20    18  10  21
Japan  97  81    17  81  27

In [69]:
df.iloc[:, 2]  # fetch all the rows of the 3rd col

India    4200
US         82
UK         18
Japan      17
Name: C, dtype: int32

In [71]:
df.iloc[-1, 0:3]  # 1st 3 columns of the last row

A    97
B    81
C    17
Name: Japan, dtype: int32

In [73]:
df.drop('E', axis=1)

        A   B     C   D
India  54  27  4200  84
US     12  67    82  13
UK     89  20    18  10
Japan  97  81    17  81

In [74]:
df

        A   B     C   D   E
India  54  27  4200  84   0
US     12  67    82  13  57
UK     89  20    18  10  21
Japan  97  81    17  81  27

In [75]:
df.drop('E', axis=1, inplace=True)
df

        A   B     C   D
India  54  27  4200  84
US     12  67    82  13
UK     89  20    18  10
Japan  97  81    17  81

In [84]:
col_names = df.columns.values
row_names = df.index.values
df = pd.DataFrame(df.values, index=df.columns.values, columns=row_names)
df

   India  US    UK  Japan
A     54  27  4200     84
B     12  67    82     13
C     89  20    18     10
D     97  81    17     81

In [85]:
# df.rename_axis() can also be used to renames rows & col

In [86]:
df.T

          A   B   C   D
India    54  12  89  97
US       27  67  20  81
UK     4200  82  18  17
Japan    84  13  10  81

In [89]:
df.describe().round(2).transpose()

       count     mean      std   min    25%   50%      75%     max
India    4.0    63.00    38.79  12.0  43.50  71.5    91.00    97.0
US       4.0    48.75    29.85  20.0  25.25  47.0    70.50    81.0
UK       4.0  1079.25  2080.72  17.0  17.75  50.0  1111.50  4200.0
Japan    4.0    47.00    41.03  10.0  12.25  47.0    81.75    84.0

In [90]:
df.info()  # quick infor qabout your dataframe

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, A to D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   India   4 non-null      int32
 1   US      4 non-null      int32
 2   UK      4 non-null      int32
 3   Japan   4 non-null      int32
dtypes: int32(4)
memory usage: 256.0+ bytes

In [91]:
df.iloc[2,2] = np.nan
df

   India  US      UK  Japan
A     54  27  4200.0     84
B     12  67    82.0     13
C     89  20     NaN     10
D     97  81    17.0     81

In [92]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, A to D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   India   4 non-null      int32
 1   US      4 non-null      int32
 2   UK      3 non-null      float64
 3   Japan   4 non-null      int32
dtypes: float64(1), int32(3)
memory usage: 272.0+ bytes

## Titanic Data Analyses

In [1]:
import pandas as pd

In [2]:
pwd

'G:\\My Drive\\Training\\SimpliLearn\\PG DS - Data Science with Python\\Batch-3'

In [3]:
titanic = pd.read_csv('titanic_train.csv')
titanic.head()   # look into the 1st 5 rows

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [102]:
path + r'\titanic_train.csv'

'C:\\Users\\Prashant\\Desktop\\titanic_train.csv'

In [100]:
path = r'C:\Users\Prashant\Desktop'
titanic = pd.read_csv(path + r'\titanic_train.csv')

In [96]:
titanic.head(8)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S

In [97]:
titanic.tail()  # last 5 rows

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [103]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [104]:
titanic.shape

(891, 12)

In [106]:
titanic.isna().sum()  # number of missing values in EACH Column!!!

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [109]:
100*titanic.isna().sum()/titanic.shape[0]   # converting the above info into percentages

PassengerId     0.000000
Survived        0.000000
Pclass          0.000000
Name            0.000000
Sex             0.000000
Age            19.865320
SibSp           0.000000
Parch           0.000000
Ticket          0.000000
Fare            0.000000
Cabin          77.104377
Embarked        0.224467
dtype: float64

In [111]:
titanic.describe().round(2)  # by defult you will get the statistical summary only the numeric columns

       PassengerId  Survived  Pclass     Age   SibSp   Parch    Fare
count       891.00    891.00  891.00  714.00  891.00  891.00  891.00
mean        446.00      0.38    2.31   29.70    0.52    0.38   32.20
std         257.35      0.49    0.84   14.53    1.10    0.81   49.69
min           1.00      0.00    1.00    0.42    0.00    0.00    0.00
25%         223.50      0.00    2.00   20.12    0.00    0.00    7.91
50%         446.00      0.00    3.00   28.00    0.00    0.00   14.45
75%         668.50      1.00    3.00   38.00    1.00    0.00   31.00
max         891.00      1.00    3.00   80.00    8.00    6.00  512.33

In [112]:
titanic.describe( include='O').round(2)

                                    Name   Sex Ticket    Cabin Embarked
count                                891   891    891      204      889
unique                               891     2    681      147        3
top     Frolicher-Stehli, Mr. Maxmillian  male   1601  B96 B98        S
freq                                   1   577      7        4      644

In [114]:
titanic['Survived'].dtype

dtype('int64')

In [4]:
titanic['Survived'] = titanic['Survived'].astype('category')

In [119]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    category
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: category(1), float64(2), int64(4), object(5)
memory usage: 77.7+ KB

In [5]:
titanic['Pclass'] = titanic['Pclass'].astype('category')
titanic['Sex'] = titanic['Sex'].astype('category')
titanic['Embarked'] = titanic['Embarked'].astype('category')
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    category
 2   Pclass       891 non-null    category
 3   Name         891 non-null    object
 4   Sex          891 non-null    category
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    category
dtypes: category(4), float64(2), int64(3), object(3)
memory usage: 59.7+ KB

In [123]:
titanic.describe(include='category')

        Survived  Pclass   Sex Embarked
count        891     891   891      889
unique         2       3     2        3
top            0       3  male        S
freq         549     491   577      644

In [6]:
titanic.drop(['PassengerId', 'Ticket', 'Cabin'], axis=1, inplace=True)
titanic.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,71.2833,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,S

In [125]:
# What are unique values in the 'Sex' col
titanic['Sex'].unique()

['male', 'female']
Categories (2, object): ['male', 'female']

In [126]:
# How many  unique values are present in the 'Sex' col
titanic['Sex'].nunique()

2

In [127]:
# What is the distribution of males & femailes in the 'Sex' col
titanic['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [129]:
# same as above, but as fractions
titanic['Sex'].value_counts(normalize=True)

male      0.647587
female    0.352413
Name: Sex, dtype: float64

In [132]:
titanic['Embarked'].unique()

['S', 'C', 'Q', NaN]
Categories (3, object): ['S', 'C', 'Q']

In [134]:
titanic['Embarked'].nunique()   # nan is not counted as a unique

3

In [139]:
titanic['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [140]:
# from which port maximum passengers have embarked
titanic['Embarked'].value_counts().index[0]

'S'

In [143]:
# How many passengers embarked from Queenstown ?
titanic[titanic['Embarked'] == 'Q']

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked
5,0,3,"Moran, Mr. James",male,NaN,0,0,8.4583,Q
16,0,3,"Rice, Master. Eugene",male,2.0,4,1,29.1250,Q
22,1,3,"McGowan, Miss. Anna ""Annie""",female,15.0,0,0,8.0292,Q
28,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,7.8792,Q
32,1,3,"Glynn, Miss. Mary Agatha",female,NaN,0,0,7.7500,Q
44,1,3,"Devaney, Miss. Margaret Delia",female,19.0,0,0,7.8792,Q
46,0,3,"Lennon, Mr. Denis",male,NaN,1,0,15.5000,Q
47,1,3,"O'Driscoll, Miss. Bridget",female,NaN,0,0,7.7500,Q
82,1,3,"McDermott, Miss. Brigdet Delia",female,NaN,0,0,7.7875,Q
109,1,3,"Moran, Miss. Bertha",female,NaN,1,0,24.1500,Q
116,0,3,"Connors, Mr. Patrick",male,70.5,0,0,7.7500,Q
126,0,3,"McMahon, Mr. Martin",male,NaN,0,0,7.7500,Q
143,0,3,"Burke, Mr. Jeremiah",male,19.0,0,0,6.7500,Q
156,1,3,"Gilnagh, Miss. Katherine ""Katie""",female,16.0,0,0,7.7333,Q
171,0,3,"Rice, Master. Arthur",male,4.0,4,1,29.1250,Q
186,1,3,"O'Brien, Mrs. Thomas (Johanna ""Hannah"" Godfrey)",female,NaN,1,0,15.5000,Q
188,0,3,"Bourke, Mr. John",male,40.0,1,1,15.5000,Q
196,0,3,"Mernagh, Mr. Robert",male,NaN,0,0,7.7500,Q
198,1,3,"Madigan, Miss. Margaret ""Maggie""",female,NaN,0,0,7.7500,Q
208,1,3,"Carr, Miss. Helen ""Ellen""",female,16.0,0,0,7.7500,Q
214,0,3,"Kiernan, Mr. Philip",male,NaN,1,0,7.7500,Q
241,1,3,"Murphy, Miss. Katherine ""Kate""",female,NaN,1,0,15.5000,Q
245,0,1,"Minahan, Dr. William Edward",male,44.0,2,0,90.0000,Q
260,0,3,"Smith, Mr. Thomas",male,NaN,0,0,7.7500,Q
264,0,3,"Henry, Miss. Delia",female,NaN,0,0,7.7500,Q
274,1,3,"Healy, Miss. Hanora ""Nora""",female,NaN,0,0,7.7500,Q
278,0,3,"Rice, Master. Eric",male,7.0,4,1,29.1250,Q
280,0,3,"Duane, Mr. Frank",male,65.0,0,0,7.7500,Q
289,1,3,"Connolly, Miss. Kate",female,22.0,0,0,7.7500,Q
300,1,3,"Kelly, Miss. Anna Katherine ""Annie Kate""",female,NaN,0,0,7.7500,Q
...,...,...,...,...,...,...,...,...,...
510,1,3,"Daly, Mr. Eugene Patrick",male,29.0,0,0,7.7500,Q
517,0,3,"Ryan, Mr. Patrick",male,NaN,0,0,24.1500,Q
525,0,3,"Farrell, Mr. James",male,40.5,0,0,7.7500,Q
552,0,3,"O'Brien, Mr. Timothy",male,NaN,0,0,7.8292,Q
560,0,3,"Morrow, Mr. Thomas Rowan",male,NaN,0,0,7.7500,Q
573,1,3,"Kelly, Miss. Mary",female,NaN,0,0,7.7500,Q
593,0,3,"Bourke, Miss. Mary",female,NaN,0,2,7.7500,Q
612,1,3,"Murphy, Miss. Margaret Jane",female,NaN,1,0,15.5000,Q
613,0,3,"Horgan, Mr. John",male,NaN,0,0,7.7500,Q
626,0,2,"Kirkland, Rev. Charles Leonard",male,57.0,0,0,12.3500,Q
629,0,3,"O'Connell, Mr. Patrick D",male,NaN,0,0,7.7333,Q
653,1,3,"O'Leary, Miss. Hanora ""Norah""",female,NaN,0,0,7.8292,Q
654,0,3,"Hegarty, Miss. Hanora ""Nora""",female,18.0,0,0,6.7500,Q
657,0,3,"Bourke, Mrs. John (Catherine)",female,32.0,1,1,15.5000,Q
680,0,3,"Peters, Miss. Katie",female,NaN,0,0,8.1375,Q
697,1,3,"Mullens, Miss. Katherine ""Katie""",female,NaN,0,0,7.7333,Q
703,0,3,"Gallagher, Mr. Martin",male,25.0,0,0,7.7417,Q
718,0,3,"McEvoy, Mr. Michael",male,NaN,0,0,15.5000,Q
727,1,3,"Mannion, Miss. Margareth",female,NaN,0,0,7.7375,Q
749,0,3,"Connaghton, Mr. Michael",male,31.0,0,0,7.7500,Q
767,0,3,"Mangan, Miss. Mary",female,30.5,0,0,7.7500,Q
768,0,3,"Moran, Mr. Daniel J",male,NaN,1,0,24.1500,Q
776,0,3,"Tobin, Mr. Roger",male,NaN,0,0,7.7500,Q
778,0,3,"Kilgannon, Mr. Thomas J",male,NaN,0,0,7.7375,Q
787,0,3,"Rice, Master. George Hugh",male,8.0,4,1,29.1250,Q
790,0,3,"Keane, Mr. Andrew ""Andy""",male,NaN,0,0,7.7500,Q
825,0,3,"Flynn, Mr. John",male,NaN,0,0,6.9500,Q
828,1,3,"McCormack, Mr. Thomas Joseph",male,NaN,0,0,7.7500,Q
885,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,29.1250,Q
890,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,7.7500,Q

In [152]:
sum(titanic['Embarked'] == 'Q')

77

In [145]:
len(titanic[titanic['Embarked'] == 'Q'])

77

In [148]:
titanic[titanic['Embarked'] == 'Q'].shape[0]

77

In [151]:
titanic['Embarked'].value_counts()['Q']

77

In [157]:
# Gimme the names & PClass of all the passengers who have age < 1 year
titanic['Age'] < 1

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: Age, Length: 891, dtype: bool

In [159]:
titanic[titanic['Age'] < 1]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked
78,1,2,"Caldwell, Master. Alden Gates",male,0.83,0,2,29.0000,S
305,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,151.5500,S
469,1,3,"Baclini, Miss. Helene Barbara",female,0.75,2,1,19.2583,C
644,1,3,"Baclini, Miss. Eugenie",female,0.75,2,1,19.2583,C
755,1,2,"Hamalainen, Master. Viljo",male,0.67,1,1,14.5000,S
803,1,3,"Thomas, Master. Assad Alexander",male,0.42,0,1,8.5167,C
831,1,2,"Richards, Master. George Sibley",male,0.83,1,1,18.7500,S

In [161]:
# how many passengers have age < 1 year
sum(titanic['Age'] < 1)

7

In [165]:
titanic[titanic['Age'] < 1][['Name', 'Pclass', 'Age']]

                                Name Pclass   Age
78     Caldwell, Master. Alden Gates      2  0.83
305   Allison, Master. Hudson Trevor      1  0.92
469    Baclini, Miss. Helene Barbara      3  0.75
644           Baclini, Miss. Eugenie      3  0.75
755        Hamalainen, Master. Viljo      2  0.67
803  Thomas, Master. Assad Alexander      3  0.42
831  Richards, Master. George Sibley      2  0.83

In [168]:
# How many passengers have age < 1 year OR >70 years
sum(   (titanic['Age'] < 1) | (titanic['Age'] > 70)   )

12

In [170]:
# what is the age of George Sibley ???
sum(titanic['Name'] == 'George Sibley')   # NOT THE RIGHT WAY !!!

0

In [8]:
for k, name in enumerate(titanic['Name']):
    if 'George Sibley' in name:
        break

In [9]:
titanic.iloc[k]

Survived                                  1
Pclass                                    2
Name        Richards, Master. George Sibley
Sex                                    male
Age                                    0.83
SibSp                                     1
Parch                                     1
Fare                                  18.75
Embarked                                  S
Name: 831, dtype: object

In [10]:
titanic.iloc[k]['Age']

0.83

In [ ]:
# Homework:

In [16]:
# How many passengers have a title "Master" in thier name ??
# titanic['Name'] 
titanic.loc[titanic['Name'].str.contains("Master")]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked
7,0,3,"Palsson, Master. Gosta Leonard",male,2.00,3,1,21.0750,S
16,0,3,"Rice, Master. Eugene",male,2.00,4,1,29.1250,Q
50,0,3,"Panula, Master. Juha Niilo",male,7.00,4,1,39.6875,S
59,0,3,"Goodwin, Master. William Frederick",male,11.00,5,2,46.9000,S
63,0,3,"Skoog, Master. Harald",male,4.00,3,2,27.9000,S
65,1,3,"Moubarek, Master. Gerios",male,NaN,1,1,15.2458,C
78,1,2,"Caldwell, Master. Alden Gates",male,0.83,0,2,29.0000,S
125,1,3,"Nicola-Yarred, Master. Elias",male,12.00,1,0,11.2417,C
159,0,3,"Sage, Master. Thomas Henry",male,NaN,8,2,69.5500,S
164,0,3,"Panula, Master. Eino Viljami",male,1.00,4,1,39.6875,S
165,1,3,"Goldsmith, Master. Frank John William ""Frankie""",male,9.00,0,2,20.5250,S
171,0,3,"Rice, Master. Arthur",male,4.00,4,1,29.1250,Q
176,0,3,"Lefebre, Master. Henry Forbes",male,NaN,3,1,25.4667,S
182,0,3,"Asplund, Master. Clarence Gustaf Hugo",male,9.00,4,2,31.3875,S
183,1,2,"Becker, Master. Richard F",male,1.00,2,1,39.0000,S
193,1,2,"Navratil, Master. Michel M",male,3.00,1,1,26.0000,S
261,1,3,"Asplund, Master. Edvin Rojj Felix",male,3.00,4,2,31.3875,S
278,0,3,"Rice, Master. Eric",male,7.00,4,1,29.1250,Q
305,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,151.5500,S
340,1,2,"Navratil, Master. Edmond Roger",male,2.00,1,1,26.0000,S
348,1,3,"Coutts, Master. William Loch ""William""",male,3.00,1,1,15.9000,S
386,0,3,"Goodwin, Master. Sidney Leonard",male,1.00,5,2,46.9000,S
407,1,2,"Richards, Master. William Rowe",male,3.00,1,1,18.7500,S
445,1,1,"Dodge, Master. Washington",male,4.00,0,2,81.8583,S
480,0,3,"Goodwin, Master. Harold Victor",male,9.00,5,2,46.9000,S
489,1,3,"Coutts, Master. Eden Leslie ""Neville""",male,9.00,1,1,15.9000,S
549,1,2,"Davies, Master. John Morgan Jr",male,8.00,1,1,36.7500,S
709,1,3,"Moubarek, Master. Halim Gonios (""William George"")",male,NaN,1,1,15.2458,C
751,1,3,"Moor, Master. Meier",male,6.00,0,1,12.4750,S
755,1,2,"Hamalainen, Master. Viljo",male,0.67,1,1,14.5000,S
787,0,3,"Rice, Master. George Hugh",male,8.00,4,1,29.1250,Q
788,1,3,"Dean, Master. Bertram Vere",male,1.00,1,2,20.5750,S
802,1,1,"Carter, Master. William Thornton II",male,11.00,1,2,120.0000,S
803,1,3,"Thomas, Master. Assad Alexander",male,0.42,0,1,8.5167,C
819,0,3,"Skoog, Master. Karl Thorsten",male,10.00,3,2,27.9000,S
824,0,3,"Panula, Master. Urho Abraham",male,2.00,4,1,39.6875,S
827,1,2,"Mallet, Master. Andre",male,1.00,0,2,37.0042,C
831,1,2,"Richards, Master. George Sibley",male,0.83,1,1,18.7500,S
850,0,3,"Andersson, Master. Sigvard Harald Elias",male,4.00,4,2,31.2750,S
869,1,3,"Johnson, Master. Harold Theodor",male,4.00,1,1,11.1333,S

In [14]:
len(titanic.loc[titanic['Name'].str.contains("Master")])

40

In [22]:
sum(titanic['Name'].str.contains('master',case=False))

40

In [29]:
sum(titanic['Name'].apply(lambda name: 'master' in name.lower()))

40

In [33]:
# How many passengers travelling in 1st class actually survived ???
titanic[(titanic['Pclass']==1) & (titanic['Survived']==1)]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,71.2833,C
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,S
11,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,26.5500,S
23,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,35.5000,S
31,1,1,"Spencer, Mrs. William Augustus (Marie Eugenie)",female,NaN,1,0,146.5208,C
52,1,1,"Harper, Mrs. Henry Sleeper (Myna Haxtun)",female,49.0,1,0,76.7292,C
55,1,1,"Woolner, Mr. Hugh",male,NaN,0,0,35.5000,S
61,1,1,"Icard, Miss. Amelie",female,38.0,0,0,80.0000,NaN
88,1,1,"Fortune, Miss. Mabel Helen",female,23.0,3,2,263.0000,S
97,1,1,"Greenfield, Mr. William Bertram",male,23.0,0,1,63.3583,C
136,1,1,"Newsom, Miss. Helen Monypeny",female,19.0,0,2,26.2833,S
151,1,1,"Pears, Mrs. Thomas (Edith Wearne)",female,22.0,1,0,66.6000,S
166,1,1,"Chibnall, Mrs. (Edith Martha Bowerman)",female,NaN,0,1,55.0000,S
187,1,1,"Romaine, Mr. Charles Hallace (""Mr C Rolmane"")",male,45.0,0,0,26.5500,S
194,1,1,"Brown, Mrs. James Joseph (Margaret Tobin)",female,44.0,0,0,27.7208,C
195,1,1,"Lurette, Miss. Elise",female,58.0,0,0,146.5208,C
209,1,1,"Blank, Mr. Henry",male,40.0,0,0,31.0000,C
215,1,1,"Newell, Miss. Madeleine",female,31.0,1,0,113.2750,C
218,1,1,"Bazzani, Miss. Albina",female,32.0,0,0,76.2917,C
224,1,1,"Hoyt, Mr. Frederick Maxfield",male,38.0,1,0,90.0000,S
230,1,1,"Harris, Mrs. Henry Birkhardt (Irene Wallach)",female,35.0,1,0,83.4750,S
248,1,1,"Beckwith, Mr. Richard Leonard",male,37.0,1,1,52.5542,S
256,1,1,"Thorne, Mrs. Gertrude Maybelle",female,NaN,0,0,79.2000,C
257,1,1,"Cherry, Miss. Gladys",female,30.0,0,0,86.5000,S
258,1,1,"Ward, Miss. Anna",female,35.0,0,0,512.3292,C
268,1,1,"Graham, Mrs. William Thompson (Edith Junkins)",female,58.0,0,1,153.4625,S
269,1,1,"Bissette, Miss. Amelia",female,35.0,0,0,135.6333,S
275,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,77.9583,S
290,1,1,"Barber, Miss. Ellen ""Nellie""",female,26.0,0,0,78.8500,S
291,1,1,"Bishop, Mrs. Dickinson H (Helen Walton)",female,19.0,1,0,91.0792,C
...,...,...,...,...,...,...,...,...,...
710,1,1,"Mayne, Mlle. Berthe Antonine (""Mrs de Villiers"")",female,24.0,0,0,49.5042,C
712,1,1,"Taylor, Mr. Elmer Zebley",male,48.0,1,0,52.0000,S
716,1,1,"Endres, Miss. Caroline Louise",female,38.0,0,0,227.5250,C
724,1,1,"Chambers, Mr. Norman Campbell",male,27.0,1,0,53.1000,S
730,1,1,"Allen, Miss. Elisabeth Walton",female,29.0,0,0,211.3375,S
737,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,512.3292,C
740,1,1,"Hawksford, Mr. Walter James",male,NaN,0,0,30.0000,S
742,1,1,"Ryerson, Miss. Susan Parker ""Suzette""",female,21.0,2,2,262.3750,C
759,1,1,"Rothes, the Countess. of (Lucy Noel Martha Dyer-Edwards)",female,33.0,0,0,86.5000,S
763,1,1,"Carter, Mrs. William Ernest (Lucile Polk)",female,36.0,1,2,120.0000,S
765,1,1,"Hogeboom, Mrs. John C (Anna Andrews)",female,51.0,1,0,77.9583,S
779,1,1,"Robert, Mrs. Edward Scott (Elisabeth Walton McMillan)",female,43.0,0,1,211.3375,S
781,1,1,"Dick, Mrs. Albert Adrian (Vera Gillespie)",female,17.0,1,0,57.0000,S
796,1,1,"Leader, Dr. Alice (Farnham)",female,49.0,0,0,25.9292,S
802,1,1,"Carter, Master. William Thornton II",male,11.0,1,2,120.0000,S
809,1,1,"Chambers, Mrs. Norman Campbell (Bertha Griggs)",female,33.0,1,0,53.1000,S
820,1,1,"Hays, Mrs. Charles Melville (Clara Jennings Gregg)",female,52.0,1,1,93.5000,S
829,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,80.0000,NaN
835,1,1,"Compton, Miss. Sara Rebecca",female,39.0,1,1,83.1583,C
839,1,1,"Marechal, Mr. Pierre",male,NaN,0,0,29.7000,C
842,1,1,"Serepeca, Miss. Augusta",female,30.0,0,0,31.0000,C
849,1,1,"Goldenberg, Mrs. Samuel L (Edwiga Grabowska)",female,NaN,1,0,89.1042,C
853,1,1,"Lines, Miss. Mary Conover",female,16.0,0,1,39.4000,S
856,1,1,"Wick, Mrs. George Dennick (Mary Hitchcock)",female,45.0,1,1,164.8667,S
857,1,1,"Daly, Mr. Peter Denis",male,51.0,0,0,26.5500,S
862,1,1,"Swift, Mrs. Frederick Joel (Margaret Welles Barron)",female,48.0,0,0,25.9292,S
871,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,52.5542,S
879,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,83.1583,C
887,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,30.0000,S
889,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,30.0000,C

In [35]:
titanic[(titanic['Pclass']==1) & (titanic['Survived']==1)].shape[0]

136

In [36]:
len(titanic[(titanic['Pclass']==1) & (titanic['Survived']==1)])

136

In [41]:
# How many passengers are travelling alone ??
titanic['Group_size'] = titanic['SibSp'] + titanic['Parch']
titanic.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,Group_size
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,S,1
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,71.2833,C,1
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,S,0
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,S,1
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,S,0

In [44]:
sum(titanic['Group_size'].apply(lambda x: x==0))

537

In [43]:
titanic['Alone'] = titanic['Group_size'].apply(lambda x: x==0)
titanic.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,Group_size,Alone
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,S,1,False
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,71.2833,C,1,False
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,S,0,True
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,S,1,False
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,S,0,True

In [45]:
titanic['Alone'].value_counts()

True     537
False    354
Name: Alone, dtype: int64

In [47]:
# !pip install pandas-profiling

In [48]:
import pandas_profiling
profile = pandas_profiling.ProfileReport(titanic)
profile.to_file(output_file = 'Titanic Data Analysis.html')

HBox(children=(HTML(value='Summarize dataset'), FloatProgress(value=0.0, max=23.0), HTML(value='')))

HBox(children=(HTML(value='Generate report structure'), FloatProgress(value=0.0, max=1.0), HTML(value='')))

C:\Users\Prashant\anaconda3\lib\site-packages\pandas_profiling\visualisation\plot.py:166: MatplotlibDeprecationWarning: You are modifying the state of a globally registered colormap. In future versions, you will not be able to modify a registered colormap in-place. To remove this warning, you can make a copy of the colormap first. cmap = copy.copy(mpl.cm.get_cmap("RdBu"))
  cmap.set_bad(cmap_bad)

HBox(children=(HTML(value='Render HTML'), FloatProgress(value=0.0, max=1.0), HTML(value='')))

HBox(children=(HTML(value='Export report to file'), FloatProgress(value=0.0, max=1.0), HTML(value='')))

In [ ]:
# !pip install sweetviz

In [49]:
import sweetviz as sv
sweet_report = sv.analyze(titanic)
sweet_report.show_html('Titanic Data Sweet Report.html')

HBox(children=(HTML(value=''), FloatProgress(value=0.0, layout=Layout(flex='2'), max=12.0), HTML(value='')), l…

Report Titanic Data Sweet Report.html was generated! NOTEBOOK/COLAB USERS: the web browser MAY not pop up, regardless, the report IS saved in your notebook/colab files.

## Save the data

In [51]:
titanic.to_pickle('titanic_clean1.pkl') # serialization (saving the Python object as a binry file)

In [52]:
titanic.to_csv('titanic_clean1.csv', index=False)

In [53]:
titanic.to_excel('titanic_clean1.xlsx', index=False, sheet_name='Titanic_clean')